Revit 2024 API
AssemblyInstance.NamingCategoryId Property
 Id of the category that drives the default naming scheme for the assembly instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ElementId NamingCategoryId { get; set; }
Visual Basic
Public Property NamingCategoryId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ NamingCategoryId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: This naming category was not valid for an assembly instance containing the proposed members. The naming category should match one of the member element categories.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
AssemblyInstance Class
Autodesk.Revit.DB Namespace